<?php  
    $p = array(0, 0, 0, 0, 0, 0, 0);  // $p[0] = 0; $p[1] = 0......$p[6] = 0
    for($i = 0;$i < 1000000; $i++) {
        $point = rand(1, 9);               //多了7~9點
        if($point >= 1 && $point <= 9) {      
            $p[$point>6?$point-3:$point]++;    //7~9透過-3視為4、5、6所以4、5、6的機率提高了(灌鉛骰子)
        }else {
            $p[0]++;
        }
    }
    
    if($p[0] == 0) {
        for ($i = 1; $i <= 6; $i++)
        echo "{$i}點出現{$p[$i]}次<hr />";
    }else {
        echo "ERROR出現{$p[0]}次";
    }

?>