<?php
    $a = 10; $b = 3;
    if($a++ > 10 | $b-- < 3) {
        echo "OK; a = {$a}, b = {$b}";
    }else{
        echo "XX; a = {$a}, b - {$b}";
    }

?>
<!-- ++在前面:先+1再比對a是否>10，++在後面:先比對a是否>10再+1 ，&&代表"且"，亦即兩邊都要符合-->
<!-- ||代表"或"，亦即只要有一邊符合後面就不必進行比對了 -->
<!-- 但是|有一邊符合，後面還是進行運算 -->
<hr />
<?php
    $a = 3; $b = 2;
    echo $a ^ $b;
?>
<hr />
<?php
    $a = 10; $b = 3;
    //$c = $a; $a = $b; $b = $c;
    
    //$a = $a + $b; //$a = 13
    //$b = $a - $b; //$b = 13 - 3 = 10
    //$a = $a - $b; //$a = 13 - 10 = 3

    $a = $a ^ $b;
    $b = $a ^ $b;
    $a = $a ^ $b;
    echo "a = {$a}, b = {$b}";
?>